/*======================================
   ■■■ 클래스와 인스턴스 ■■■
   - 클래스와 인스턴스 활용
=======================================*/

//	2. Sungjuck 클래스
//	- 인원 수를 입력받아, 입력받은 인원 수 만큼
//	  이름, 국어점수, 영어점수, 수학점수를 입력받고
//	  총점과 평균을 산출하는 클래스로 설계할 것~!!!
//	  - 속성 : 인원수, Record 타입의 배열
//	  - 기능 : 인원수 입력, 상세 데이터 입력, 총점 및 평균 연산, 결과 출력


// 1. 속성으로 인원수 변수와 Record클래스의 객체 배열을 생성해야한다...?
// 2. 메소드 기능들을 구현할 것
//		→인원수 입력 메소드/데이터 입력 메소드 (입력 메소드)
//		→														(데이터 입력 메소드)
//		→총점 및 평균 연산 메소드
//		→결과 출력 메소드

import java.util.Scanner;

public class Sungjuk
{
	int studentNum;
	
	Record[] rec1 = new Record();

	void input()
	{
		Scanner sc = new Scanner(System.in);
		

	}
}