/*==========================================
   ■■■ 배열 ■■■
   - 배열의 배열
============================================*/

// 배열의 배열(다차원 배열)을 활용하여
// 다음과 같은 데이터를 요소로 취하는 배열을 구성하고
// 그 결과를 출력하는 프로그램을 구현한다.

// 실행 예)
/*

	1  2  3  4  5		i=0→12345		→ 0 위치 부터 출발
	5  1  2  3  4		i=1→12345		→ 1 위치 부터 출발
	4  5  1  2  3		i=2→12345		→ 2 위치 부터 출발
	3  4  5  1  2		i=3→12345		→ 3 위치 부터 출발
	2  3  4  5  1		i=4→12345		→ 4 위치 부터 출발

					 0으로...
	1	2	3	4	5|	  
		1	2	3	4|	5 
			1	2	3|	4	5
				1	2|	3	4	5
					1|	2	3	4	5


	00 01 02 03 04
	10 11 12 13 14
	20 21 22 23 24
	30 31 32 33 34
	40 41 42 43 44
계속하려면 아무 키나 누르세요...
*/

public class Test088
{
	public static void main(String[] args)
	{
		// 배열의 배열 선언 및 메모리 할당
		int[][] arr = new int[5][5];

		for (int i=0; i<arr.length; i++)
		{
			for (int n=1, j=i; n<=5; n++)
			{
				//테스트(확인)
				//System.out.print(i+","+j+"- "+"["+n+"] "  );
				arr[i][j] = n;
				j++;

				if(j==5)
					j=0;
			}
			//System.out.println();
		}
		
		for (int i=0; i<arr.length; i++)
		{
			for (int j=0; j<arr[i].length; j++)
			{
				System.out.printf("%2d", arr[i][j]);
			}
			System.out.println();
		}

	}
}

/*
		//보영님 방법
		//신기함
		int[][] arr = new int[5][5];
		for (int i=0; i<arr.length; i++)
		{
			int a = 1;
			int b = 6-i;
			for (int j=0; j<arr[i].length; j++)
			{
				
				if (i <= j)
					arr[i][j] = a++;
				else
					arr[i][j] = b++;
			}
		}

		for (int i=0; i<arr.length; i++)
		{
			for (int j=0; j<arr[i].length; j++)
			{
				System.out.printf("%3d",arr[i][j]);
			}
			System.out.println();
		}

*/


/*
이해 코스 1번
// 배열의 배열 선언 및 메모리 할당
		int[][] arr = new int[5][5];

		for (int i=0; i<arr.length; i++)
		{
			for (int n=1, j=i; n<=5; n++)
			{
				//테스트(확인)
				System.out.print(i+","+j+"- "+"["+n+"] "  );
				j++;
			}
			System.out.println();
0,0- [1] 0,1- [2] 0,2- [3] 0,3- [4] 0,4- [5]
1,1- [1] 1,2- [2] 1,3- [3] 1,4- [4] 1,5- [5]
2,2- [1] 2,3- [2] 2,4- [3] 2,5- [4] 2,6- [5]
3,3- [1] 3,4- [2] 3,5- [3] 3,6- [4] 3,7- [5]
4,4- [1] 4,5- [2] 4,6- [3] 4,7- [4] 4,8- [5]
계속하려면 아무 키나 누르십시오 . . .

*/

/*
이해 코스 2번
if(j==5)
	j=0;
	↓
0,0- [1] 0,1- [2] 0,2- [3] 0,3- [4] 0,4- [5]
         1,1- [1] 1,2- [2] 1,3- [3] 1,4- [4] |	1,0- [5]
                  2,2- [1] 2,3- [2] 2,4- [3] |	2,0- [4] 2,1- [5]
                           3,3- [1] 3,4- [2] |	3,0- [3] 3,1- [4] 3,2- [5]
                                    4,4- [1] |	4,0- [2] 4,1- [3] 4,2- [4] 4,3- [5]

*/
