/*======================================
   ■■■ 정렬(Sort) 알고리즘 ■■■
=======================================*/

/*
○ 정렬
	: 데이터를 특정한 규칙(기준)에 맞게 순서대로 나열(오름차순, 내림차순)


○ 정렬의 목적
	:데이터 처리 과정의 편의성이나 가독성을 높이기 위함
	 →보기 좋게...... 검색하기 위함
	 리소스 소모 큼

○ 정렬의 종류
	: 선택 정렬, 버블 정렬, 삽입 정렬, 힙 정렬, 퀵 정렬, 쉘 정렬, ..............


*/

// 버블 정렬(거품 정렬, Bubble Sort)

// 실행 예)
// Source Data : 52 42 12 62 60
// Sorted Data : 12 42 52 60 62
// 계속하려면 아무 키나 누르세요...

public class Test108
{
	public static void main(String[] args)
	{
		int[] a = {52, 42, 12, 62, 60};
		
		System.out.print("Source Data : ");
		for (int i=0; i<a.length; i++)
		{
			System.out.printf("%3d " ,a[i]);
		}
		System.out.println();
		/*
		52  42  12  62  60		00 01			00 01 02 03 04	/00 01 02 03  / 00 01 02 /   00 01 
		==  --
		
		42  52  12  62  60		01 02
		    ==  --

		42  12  52  62  60      02 03
		        ==  --

		42  12  52  62  60      03 04
		            ==  --

		42  12  52  60  62
		--------------------------------1회전

		42  12  52  60  62      00 01  
		==  --

		12  42  52  60  62      01 02
		    ==  --

		12  42  52  60  62      02 03
		        ==  --
		--------------------------------2회전
		
		12  42  52  60  62      00  01
	    ==  --

		12  42  52  60  62      01  02
	        ==  --
		--------------------------------3회전

		12  42  52  60  62      00  01
	    ==  --
		--------------------------------4회전
		*/


		// Bubble Sort
		
		for (int i=1; i<a.length; i++)				//i  →  1       2      3     4
		{
			for (int j=0; j<a.length-i; j++)		//       |       |      |     |
			{
				if (a[j]>a[j+1])//오름차순			//j  →  0123   012     01    0
				//if(a[j]<a[j+1]) 
				{
					//자리 바꿈
					a[j]=a[j]^a[j+1];
					a[j+1]=a[j+1]^a[j];
					a[j]=a[j]^a[j+1];
				}
			}
		}
		//00 01 02 03 04    00 01 02 03   00 01 02    00 01
		//i는 0부터 4까지 가는데 j는 1개씩 줄어듬
		/*
		for (int i=5; i<a.length; i--)
		{
			for (int j=0; j<a.length; j++)
			{
				if (a[i]>a[j])
				{
					a[i]=a[i]^a[j];
					a[j]=a[j]^a[i];
					a[i]=a[i]^a[j];
				}
			}
		}*/

		System.out.print("Sorted Data : ");
		for (int i=0; i<a.length; i++)
		{
			System.out.printf("%3d " ,a[i]);
		}
		System.out.println();

	}
}



//실행 결과

/*
Source Data :  52  42  12  62  60
Sorted Data :  12  42  52  60  62
계속하려면 아무 키나 누르십시오 . . .
*/